In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'a': {0: 'Blondie', 1: 'Christopher Cross', 2: 'Joan Jett'},
 'b': {0: '6', 1: '3', 2: '7'},
 'c': {0: 'Call Me', 1: "Arthur's Theme", 2: 'I Love Rock and Roll'},
 'd': {0: '1980', 1: '1981', 2: '1982'}})

In [5]:
df

                   a  b                     c     d
0            Blondie  6               Call Me  1980
1  Christopher Cross  3        Arthur's Theme  1981
2          Joan Jett  7  I Love Rock and Roll  1982

In [6]:
list_labels = ['year', 'artist', 'song', 'chart weeks']

In [7]:
df.columns = list_labels

In [8]:
df

                year artist                  song chart weeks
0            Blondie      6               Call Me        1980
1  Christopher Cross      3        Arthur's Theme        1981
2          Joan Jett      7  I Love Rock and Roll        1982